## Data cleasning and airline delay analysis

### Libraries to import

In [71]:
import pandas as pd

### Read in the wide csv. comment after you use the above block to read from github

In [72]:
data = pd.read_csv("https://raw.githubusercontent.com/deanpienica/dav5400/master/W9_Assn.csv")

In [73]:
data.head(10)

,NA,NA,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,ALASKA,On Time,497,221,212,503,1841
1,NaN,Delayed,62,12,20,102,305
2,AM WEST,On Time,694,4840,383,320,201
3,NaN,Delayed,117,415,65,129,61

### Rename columns

In [74]:
data.columns = ['Airline', 'Status','Los Angeles','Phoenix','San Diego','San Francisco','Seattle']

In [75]:
data.head(10)

   Airline    Status  Los Angeles  Phoenix  San Diego  San Francisco  Seattle
0   ALASKA   On Time          497      221        212            503     1841
1      NaN   Delayed           62       12         20            102      305
2  AM WEST   On Time          694     4840        383            320      201
3      NaN   Delayed          117      415         65            129       61

### Handle nans

In [76]:
data['Airline'].fillna(method='ffill',inplace=True)

In [77]:
data.head(10)

   Airline    Status  Los Angeles  Phoenix  San Diego  San Francisco  Seattle
0   ALASKA   On Time          497      221        212            503     1841
1   ALASKA   Delayed           62       12         20            102      305
2  AM WEST   On Time          694     4840        383            320      201
3  AM WEST   Delayed          117      415         65            129       61

### Add all airports aas another column with all row combinations with airline and status
### Then add new column for count of that instance
### We can get to long form using this

In [78]:
def gather( df, key, value, cols ):
    id_vars = [ col for col in df.columns if col not in cols ]
    id_values = cols
    var_name = key
    value_name = value
    return pd.melt( df, id_vars, id_values, var_name, value_name )

In [79]:
data_long = gather( data, 'Station', 'count', ['Seattle','Phoenix','Los Angeles','San Diego','San Francisco'] )

### Sort data

In [80]:
data_long = data_long.sort_values(['Airline','Status'])

### Tidy data in long format

In [81]:
data_long

    Airline    Status        Station  count
1    ALASKA   Delayed        Seattle    305
5    ALASKA   Delayed        Phoenix     12
9    ALASKA   Delayed    Los Angeles     62
13   ALASKA   Delayed      San Diego     20
17   ALASKA   Delayed  San Francisco    102
0    ALASKA   On Time        Seattle   1841
4    ALASKA   On Time        Phoenix    221
8    ALASKA   On Time    Los Angeles    497
12   ALASKA   On Time      San Diego    212
16   ALASKA   On Time  San Francisco    503
3   AM WEST   Delayed        Seattle     61
7   AM WEST   Delayed        Phoenix    415
11  AM WEST   Delayed    Los Angeles    117
15  AM WEST   Delayed      San Diego     65
19  AM WEST   Delayed  San Francisco    129
2   AM WEST   On Time        Seattle    201
6   AM WEST   On Time        Phoenix   4840
10  AM WEST   On Time    Los Angeles    694
14  AM WEST   On Time      San Diego    383
18  AM WEST   On Time  San Francisco    320

### Analysis 1 : which airlines overall has less % of delays

In [82]:
grouped_data = data_long.groupby(['Airline','Status']).sum()
print(grouped_data)

                  count
Airline Status
ALASKA   Delayed    501
         On Time   3274
AM WEST  Delayed    787
         On Time   6438

In [83]:
alaska_per_delay = grouped_data['count'][0]/(grouped_data['count'][0]+grouped_data['count'][1])
amwest_per_delay = grouped_data['count'][2]/(grouped_data['count'][2]+grouped_data['count'][3])
print('Percentage of deay of alaska airline')
print(alaska_per_delay)
print('Percentage of deay of amwest airline')
print(amwest_per_delay)

Percentage of deay of alaska airline
0.13271523178807948
Percentage of deay of amwest airline
0.10892733564013841

### Amwest airlines have less % of delays overall

### Analysis 2 : for each city which is the airlines least number of delays

In [84]:
gdata2=data_long.groupby(['Station','Airline','Status']).sum()
print(gdata2)

                                count
Station       Airline Status
Los Angeles   ALASKA   Delayed     62
                       On Time    497
              AM WEST  Delayed    117
                       On Time    694
Phoenix       ALASKA   Delayed     12
                       On Time    221
              AM WEST  Delayed    415
                       On Time   4840
San Diego     ALASKA   Delayed     20
                       On Time    212
              AM WEST  Delayed     65
                       On Time    383
San Francisco ALASKA   Delayed    102
                       On Time    503
              AM WEST  Delayed    129
                       On Time    320
Seattle       ALASKA   Delayed    305
                       On Time   1841
              AM WEST  Delayed     61
                       On Time    201

## From the above we can see that airlines for each city with lesser numebr of delays

### To convert back to from wide to long we would make sure that nan is not present and relevant headers are present for bette visual representation